tap "epk/epk"
tap "railwaycat/emacsmacport"
brew "xz"
brew "autoconf"
brew "automake"
brew "bash"
brew "bazelisk"
brew "openssl@3"
brew "protobuf"
brew "bear"
brew "bison"
brew "buildifier"
brew "glib"
brew "ccache"
brew "chruby"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "coreutils"
brew "fd"
brew "gdbm"
brew "harfbuzz"
brew "ghostscript"
brew "readline"
brew "google-benchmark"
brew "googletest"
brew "icu4c@76"
brew "librsvg"
brew "libtool"
brew "graphviz"
brew "htop"
brew "hyperfine"
brew "latexindent"
brew "libffi"
brew "libomp"
brew "libyaml"
brew "llvm"
brew "lld"
brew "llvm@17"
brew "lua-language-server"
brew "make"
brew "moreutils"
brew "mutt"
brew "ncdu"
brew "ninja"
brew "node"
brew "opam"
brew "open-mpi"
brew "openssl@1.1"
brew "pandoc"
brew "qrencode"
brew "ripgrep"
brew "rsync"
brew "ruby-install"
brew "tmate"
brew "typst"
brew "vim"
brew "wget"
brew "zellij"
brew "zig"
cask "emacs-mac"
cask "font-sf-mono-nerd-font"
cask "mactex"
cask "racket"
vscode "0h7z.vscode-julia-format"
vscode "13xforever.language-x86-64-assembly"
vscode "cschlosser.doxdocgen"
vscode "james-yu.latex-workshop"
vscode "jock.svg"
vscode "julialang.language-julia"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "nvarner.typst-lsp"
vscode "simonsiefke.svg-preview"
vscode "sissel.shopify-liquid"
vscode "tintinweb.graphviz-interactive-preview"
